In [3]:
import pandas as pd

## Generate DF

In [4]:
l = [1,4,5,6]
pd.DataFrame(l)

   0
0  1
1  4
2  5
3  6

## View

In [5]:
df = pd.DataFrame(l)
df

   0
0  1
1  4
2  5
3  6

In [6]:
df.head()

   0
0  1
1  4
2  5
3  6

In [7]:
df.tail()

   0
0  1
1  4
2  5
3  6

In [9]:
df.describe()

              0
count  4.000000
mean   4.000000
std    2.160247
min    1.000000
25%    3.250000
50%    4.500000
75%    5.250000
max    6.000000

In [11]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
df.columns

RangeIndex(start=0, stop=1, step=1)

In [55]:
df.shape

(4, 1)

In [58]:
df.size

4

In [59]:
len(df)

4

## Indexing

In [29]:
data = {'Name': ['Tom', 'nick', 'krish', 'jack'],
        'Age': [20, 21, 19, 18]}
df = pd.DataFrame(data)

In [30]:
df = df.set_index('Name')

In [20]:
df

       Age
Name
Tom     20
nick    21
krish   19
jack    18

In [21]:
df.iloc[2,0]

19

In [24]:
df.loc['Tom','Age']

20

In [26]:
df.reset_index()

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [31]:
df[:3]

       Age
Name
Tom     20
nick    21
krish   19

In [32]:
df[df.Age>20]

      Age
Name
nick   21

In [33]:
df[df.Age.isin([20,21])]

      Age
Name
Tom    20
nick   21

In [34]:
df[df.Age>20]['Age']=40

<ipython-input-34-0de109e2cb71>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df.Age>20]['Age']=40

In [35]:
df

       Age
Name
Tom     20
nick    21
krish   19
jack    18

## Functions

In [52]:
def fun1(x):
    return x+1
df.apply(lambda row:fun1(row))

       Age
Name
Tom     21
nick    22
krish   20
jack    19

In [53]:
df

       Age
Name
Tom     20
nick    21
krish   19
jack    18

## Concat

In [64]:
df1 = pd.DataFrame({'Name': ['Tom', 'nick', 'krish', 'jack'],
        'Age': [20, 21, 19, 18]})
df2 = pd.DataFrame({'Name': ['sdas', 'nick', 'vc', 'gerf'],
        'Age': [222, 321, 191, 181]})

In [65]:
df1.append(df2)

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18
0   sdas  222
1   nick  321
2     vc  191
3   gerf  181

In [72]:
df1.merge(df2,on='Name')

   Name  Age_x  Age_y
0  nick     21    321

In [73]:
df1.merge(df2,on='Name',how='left')

    Name  Age_x  Age_y
0    Tom     20    NaN
1   nick     21  321.0
2  krish     19    NaN
3   jack     18    NaN

## Groupby

In [71]:
df1.groupby('Name').mean()

       Age
Name
Tom     20
jack    18
krish   19
nick    21

## Others

Percentile

In [36]:
import numpy as np

In [37]:
np.percentile(df.Age,[0,25,50,100])

array([18.  , 18.75, 19.5 , 21.  ])

In [38]:
df.Age.mean()

19.5

In [41]:
np.mean(df.Age)

19.5

In [50]:
df.mean(axis = 1)

Name
Tom      20.0
nick     21.0
krish    19.0
jack     18.0
dtype: float64

In [74]:
for i,row in df.iterrows():
    print(i,row)

Tom Age    20
Name: Tom, dtype: int64
nick Age    21
Name: nick, dtype: int64
krish Age    19
Name: krish, dtype: int64
jack Age    18
Name: jack, dtype: int64

In [75]:
for i,row in df.iteritems():
    print(i,row)

Age Name
Tom      20
nick     21
krish    19
jack     18
Name: Age, dtype: int64